/*
* @Author: fozero@126.
* @Date:   2018-10-30 18:13:00
* @Last Modified by:   fozero
* @Last Modified time: 2018-10-30 18:13:05
*/
var citylist = [
  { "id": "2", "name": "北京", "children": [{ "id": "36", "name": "北京市" }] },
  { "id": "3", "name": "天津", "children": [{ "id": "37", "name": "天津市" }] },
  {
    "id": "4",
    "name": "河北",
    "children": [
      { "id": "38", "name": "石家庄市" },
      { "id": "39", "name": "唐山市" },
      { "id": "40", "name": "秦皇岛市" },
      { "id": "41", "name": "邯郸市" },
      { "id": "42", "name": "邢台市" },
      { "id": "43", "name": "保定市" },
      { "id": "44", "name": "张家口市" },
      { "id": "45", "name": "承德市" },
      { "id": "46", "name": "沧州市" },
      { "id": "47", "name": "廊坊市" },
      { "id": "48", "name": "衡水市" }
    ]
  },
  {
    "id": "5",
    "name": "山西",
    "children": [
      { "id": "49", "name": "太原市" },
      { "id": "50", "name": "大同市" },
      { "id": "51", "name": "阳泉市" },
      { "id": "52", "name": "长治市" },
      { "id": "53", "name": "晋城市" },
      { "id": "54", "name": "朔州市" },
      { "id": "55", "name": "晋中市" },
      { "id": "56", "name": "运城市" },
      { "id": "57", "name": "忻州市" },
      { "id": "58", "name": "临汾市" },
      { "id": "59", "name": "吕梁市" }
    ]
  },
  {
    "id": "6",
    "name": "内蒙古",
    "children": [
      { "id": "60", "name": "呼和浩特市" },
      { "id": "61", "name": "包头市" },
      { "id": "62", "name": "乌海市" },
      { "id": "63", "name": "赤峰市" },
      { "id": "64", "name": "通辽市" },
      { "id": "65", "name": "鄂尔多斯市" },
      { "id": "66", "name": "呼伦贝尔市" },
      { "id": "67", "name": "巴彦淖尔市" },
      { "id": "68", "name": "乌兰察布市" },
      { "id": "69", "name": "兴安盟" },
      { "id": "70", "name": "锡林郭勒盟" },
      { "id": "71", "name": "阿拉善盟" }
    ]
  },
  {
    "id": "7",
    "name": "辽宁",
    "children": [
      { "id": "72", "name": "沈阳市" },
      { "id": "73", "name": "大连市" },
      { "id": "74", "name": "鞍山市" },
      { "id": "75", "name": "抚顺市" },
      { "id": "76", "name": "本溪市" },
      { "id": "77", "name": "丹东市" },
      { "id": "78", "name": "锦州市" },
      { "id": "79", "name": "营口市" },
      { "id": "80", "name": "阜新市" },
      { "id": "81", "name": "辽阳市" },
      { "id": "82", "name": "盘锦市" },
      { "id": "83", "name": "铁岭市" },
      { "id": "84", "name": "朝阳市" },
      { "id": "85", "name": "葫芦岛市" }
    ]
  },
  {
    "id": "8",
    "name": "吉林",
    "children": [
      { "id": "86", "name": "长春市" },
      { "id": "87", "name": "吉林市" },
      { "id": "88", "name": "四平市" },
      { "id": "89", "name": "辽源市" },
      { "id": "90", "name": "通化市" },
      { "id": "91", "name": "白山市" },
      { "id": "92", "name": "松原市" },
      { "id": "93", "name": "白城市" },
      { "id": "94", "name": "延边朝鲜族自治州" }
    ]
  },
  {
    "id": "9",
    "name": "黑龙江",
    "children": [
      { "id": "95", "name": "哈尔滨市" },
      { "id": "96", "name": "齐齐哈尔市" },
      { "id": "97", "name": "鸡西市" },
      { "id": "98", "name": "鹤岗市" },
      { "id": "99", "name": "双鸭山市" },
      { "id": "100", "name": "大庆市" },
      { "id": "101", "name": "伊春市" },
      { "id": "102", "name": "佳木斯市" },
      { "id": "103", "name": "七台河市" },
      { "id": "104", "name": "牡丹江市" },
      { "id": "105", "name": "黑河市" },
      { "id": "106", "name": "绥化市" },
      { "id": "107", "name": "大兴安岭地区" }
    ]
  },
  {
    "id": "10",
    "name": "上海",
    "children": [{ "id": "108", "name": "上海市" }]
  },
  {
    "id": "11",
    "name": "江苏",
    "children": [
      { "id": "109", "name": "南京市" },
      { "id": "110", "name": "无锡市" },
      { "id": "111", "name": "徐州市" },
      { "id": "112", "name": "常州市" },
      { "id": "113", "name": "苏州市" },
      { "id": "114", "name": "南通市" },
      { "id": "115", "name": "连云港市" },
      { "id": "116", "name": "淮安市" },
      { "id": "117", "name": "盐城市" },
      { "id": "118", "name": "扬州市" },
      { "id": "119", "name": "镇江市" },
      { "id": "120", "name": "泰州市" },
      { "id": "121", "name": "宿迁市" }
    ]
  },
  {
    "id": "12",
    "name": "浙江",
    "children": [
      { "id": "122", "name": "杭州市" },
      { "id": "123", "name": "宁波市" },
      { "id": "124", "name": "温州市" },
      { "id": "125", "name": "嘉兴市" },
      { "id": "126", "name": "湖州市" },
      { "id": "127", "name": "绍兴市" },
      { "id": "128", "name": "金华市" },
      { "id": "129", "name": "衢州市" },
      { "id": "130", "name": "舟山市" },
      { "id": "131", "name": "台州市" },
      { "id": "132", "name": "丽水市" }
    ]
  },
  {
    "id": "13",
    "name": "安徽",
    "children": [
      { "id": "133", "name": "合肥市" },
      { "id": "134", "name": "芜湖市" },
      { "id": "135", "name": "蚌埠市" },
      { "id": "136", "name": "淮南市" },
      { "id": "137", "name": "马鞍山市" },
      { "id": "138", "name": "淮北市" },
      { "id": "139", "name": "铜陵市" },
      { "id": "140", "name": "安庆市" },
      { "id": "141", "name": "黄山市" },
      { "id": "142", "name": "滁州市" },
      { "id": "143", "name": "阜阳市" },
      { "id": "144", "name": "宿州市" },
      { "id": "146", "name": "六安市" },
      { "id": "147", "name": "亳州市" },
      { "id": "148", "name": "池州市" },
      { "id": "149", "name": "宣城市" }
    ]
  },
  {
    "id": "14",
    "name": "福建",
    "children": [
      { "id": "150", "name": "福州市" },
      { "id": "151", "name": "厦门市" },
      { "id": "152", "name": "莆田市" },
      { "id": "153", "name": "三明市" },
      { "id": "154", "name": "泉州市" },
      { "id": "155", "name": "漳州市" },
      { "id": "156", "name": "南平市" },
      { "id": "157", "name": "龙岩市" },
      { "id": "158", "name": "宁德市" }
    ]
  },
  {
    "id": "15",
    "name": "江西",
    "children": [
      { "id": "159", "name": "南昌市" },
      { "id": "160", "name": "景德镇市" },
      { "id": "161", "name": "萍乡市" },
      { "id": "162", "name": "九江市" },
      { "id": "163", "name": "新余市" },
      { "id": "164", "name": "鹰潭市" },
      { "id": "165", "name": "赣州市" },
      { "id": "166", "name": "吉安市" },
      { "id": "167", "name": "宜春市" },
      { "id": "168", "name": "抚州市" },
      { "id": "169", "name": "上饶市" }
    ]
  },
  {
    "id": "16",
    "name": "山东",
    "children": [
      { "id": "170", "name": "济南市" },
      { "id": "171", "name": "青岛市" },
      { "id": "172", "name": "淄博市" },
      { "id": "173", "name": "枣庄市" },
      { "id": "174", "name": "东营市" },
      { "id": "175", "name": "烟台市" },
      { "id": "176", "name": "潍坊市" },
      { "id": "177", "name": "济宁市" },
      { "id": "178", "name": "泰安市" },
      { "id": "179", "name": "威海市" },
      { "id": "180", "name": "日照市" },
      { "id": "181", "name": "莱芜市" },
      { "id": "182", "name": "临沂市" },
      { "id": "183", "name": "德州市" },
      { "id": "184", "name": "聊城市" },
      { "id": "185", "name": "滨州市" },
      { "id": "186", "name": "菏泽市" }
    ]
  },
  {
    "id": "17",
    "name": "河南",
    "children": [
      { "id": "187", "name": "郑州市" },
      { "id": "188", "name": "开封市" },
      { "id": "189", "name": "洛阳市" },
      { "id": "190", "name": "平顶山市" },
      { "id": "191", "name": "安阳市" },
      { "id": "192", "name": "鹤壁市" },
      { "id": "193", "name": "新乡市" },
      { "id": "194", "name": "焦作市" },
      { "id": "195", "name": "济源市" },
      { "id": "196", "name": "濮阳市" },
      { "id": "197", "name": "许昌市" },
      { "id": "198", "name": "漯河市" },
      { "id": "199", "name": "三门峡市" },
      { "id": "200", "name": "南阳市" },
      { "id": "201", "name": "商丘市" },
      { "id": "202", "name": "信阳市" },
      { "id": "203", "name": "周口市" },
      { "id": "204", "name": "驻马店市" }
    ]
  },
  {
    "id": "18",
    "name": "湖北",
    "children": [
      { "id": "205", "name": "武汉市" },
      { "id": "206", "name": "黄石市" },
      { "id": "207", "name": "十堰市" },
      { "id": "208", "name": "宜昌市" },
      { "id": "209", "name": "襄阳市" },
      { "id": "210", "name": "鄂州市" },
      { "id": "211", "name": "荆门市" },
      { "id": "212", "name": "孝感市" },
      { "id": "213", "name": "荆州市" },
      { "id": "214", "name": "黄冈市" },
      { "id": "215", "name": "咸宁市" },
      { "id": "216", "name": "随州市" },
      { "id": "217", "name": "恩施土家族苗族自治州" },
      { "id": "218", "name": "省直辖县级行政单位" }
    ]
  },
  {
    "id": "19",
    "name": "湖南",
    "children": [
      { "id": "219", "name": "长沙市" },
      { "id": "220", "name": "株洲市" },
      { "id": "221", "name": "湘潭市" },
      { "id": "222", "name": "衡阳市" },
      { "id": "223", "name": "邵阳市" },
      { "id": "224", "name": "岳阳市" },
      { "id": "225", "name": "常德市" },
      { "id": "226", "name": "张家界市" },
      { "id": "227", "name": "益阳市" },
      { "id": "228", "name": "郴州市" },
      { "id": "229", "name": "永州市" },
      { "id": "230", "name": "怀化市" },
      { "id": "231", "name": "娄底市" },
      { "id": "232", "name": "湘西土家族苗族自治州" }
    ]
  },
  {
    "id": "20",
    "name": "广东",
    "children": [
      { "id": "233", "name": "广州市" },
      { "id": "234", "name": "韶关市" },
      { "id": "235", "name": "深圳市" },
      { "id": "236", "name": "珠海市" },
      { "id": "237", "name": "汕头市" },
      { "id": "238", "name": "佛山市" },
      { "id": "239", "name": "江门市" },
      { "id": "240", "name": "湛江市" },
      { "id": "241", "name": "茂名市" },
      { "id": "242", "name": "肇庆市" },
      { "id": "243", "name": "惠州市" },
      { "id": "244", "name": "梅州市" },
      { "id": "245", "name": "汕尾市" },
      { "id": "246", "name": "河源市" },
      { "id": "247", "name": "阳江市" },
      { "id": "248", "name": "清远市" },
      { "id": "249", "name": "潮州市" },
      { "id": "250", "name": "揭阳市" },
      { "id": "251", "name": "云浮市" },
      { "id": "252", "name": "东莞市" },
      { "id": "253", "name": "中山市" }
    ]
  },
  {
    "id": "21",
    "name": "广西",
    "children": [
      { "id": "254", "name": "南宁市" },
      { "id": "255", "name": "柳州市" },
      { "id": "256", "name": "桂林市" },
      { "id": "257", "name": "梧州市" },
      { "id": "258", "name": "北海市" },
      { "id": "259", "name": "防城港市" },
      { "id": "260", "name": "钦州市" },
      { "id": "261", "name": "贵港市" },
      { "id": "262", "name": "玉林市" },
      { "id": "263", "name": "百色市" },
      { "id": "264", "name": "贺州市" },
      { "id": "265", "name": "河池市" },
      { "id": "266", "name": "来宾市" },
      { "id": "267", "name": "崇左市" }
    ]
  },
  {
    "id": "22",
    "name": "海南",
    "children": [
      { "id": "268", "name": "海口市" },
      { "id": "269", "name": "省直辖县级行政单位" },
      { "id": "270", "name": "三亚市" }
    ]
  },
  {
    "id": "23",
    "name": "重庆",
    "children": [{ "id": "271", "name": "重庆市" }]
  },
  {
    "id": "24",
    "name": "四川",
    "children": [
      { "id": "272", "name": "成都市" },
      { "id": "273", "name": "自贡市" },
      { "id": "274", "name": "攀枝花市" },
      { "id": "275", "name": "泸州市" },
      { "id": "276", "name": "德阳市" },
      { "id": "277", "name": "绵阳市" },
      { "id": "278", "name": "广元市" },
      { "id": "279", "name": "遂宁市" },
      { "id": "280", "name": "内江市" },
      { "id": "281", "name": "乐山市" },
      { "id": "282", "name": "南充市" },
      { "id": "283", "name": "眉山市" },
      { "id": "284", "name": "宜宾市" },
      { "id": "285", "name": "广安市" },
      { "id": "286", "name": "达州市" },
      { "id": "287", "name": "雅安市" },
      { "id": "288", "name": "巴中市" },
      { "id": "289", "name": "资阳市" },
      { "id": "290", "name": "阿坝藏族羌族自治州" },
      { "id": "291", "name": "甘孜藏族自治州" },
      { "id": "292", "name": "凉山彝族自治州" }
    ]
  },
  {
    "id": "25",
    "name": "贵州",
    "children": [
      { "id": "293", "name": "贵阳市" },
      { "id": "294", "name": "六盘水市" },
      { "id": "295", "name": "遵义市" },
      { "id": "296", "name": "安顺市" },
      { "id": "298", "name": "黔西南布依族苗族自治州" },
      { "id": "299", "name": "毕节地区" },
      { "id": "300", "name": "黔东南苗族侗族自治州" },
      { "id": "301", "name": "黔南布依族苗族自治州" },
      { "id": "821470", "name": "铜仁地区" }
    ]
  },
  {
    "id": "26",
    "name": "云南",
    "children": [
      { "id": "302", "name": "昆明市" },
      { "id": "303", "name": "曲靖市" },
      { "id": "304", "name": "玉溪市" },
      { "id": "305", "name": "保山市" },
      { "id": "306", "name": "昭通市" },
      { "id": "307", "name": "丽江市" },
      { "id": "308", "name": "普洱市" },
      { "id": "309", "name": "临沧市" },
      { "id": "310", "name": "楚雄彝族自治州" },
      { "id": "311", "name": "红河哈尼族彝族自治州" },
      { "id": "312", "name": "文山壮族苗族自治州" },
      { "id": "313", "name": "西双版纳傣族自治州" },
      { "id": "314", "name": "大理白族自治州" },
      { "id": "315", "name": "德宏傣族景颇族自治州" },
      { "id": "316", "name": "怒江傈僳族自治州" },
      { "id": "317", "name": "迪庆藏族自治州" }
    ]
  },
  {
    "id": "27",
    "name": "西藏",
    "children": [
      { "id": "318", "name": "拉萨市" },
      { "id": "319", "name": "昌都地区" },
      { "id": "320", "name": "山南地区" },
      { "id": "321", "name": "日喀则地区" },
      { "id": "322", "name": "那曲地区" },
      { "id": "323", "name": "阿里地区" },
      { "id": "324", "name": "林芝地区" },
      { "id": "821485", "name": "林芝市" }
    ]
  },
  {
    "id": "28",
    "name": "陕西",
    "children": [
      { "id": "325", "name": "西安市" },
      { "id": "326", "name": "铜川市" },
      { "id": "327", "name": "宝鸡市" },
      { "id": "328", "name": "咸阳市" },
      { "id": "329", "name": "渭南市" },
      { "id": "330", "name": "延安市" },
      { "id": "331", "name": "汉中市" },
      { "id": "332", "name": "榆林市" },
      { "id": "333", "name": "安康市" },
      { "id": "334", "name": "商洛市" }
    ]
  },
  {
    "id": "29",
    "name": "甘肃",
    "children": [
      { "id": "335", "name": "兰州市" },
      { "id": "336", "name": "嘉峪关市" },
      { "id": "337", "name": "金昌市" },
      { "id": "338", "name": "白银市" },
      { "id": "339", "name": "天水市" },
      { "id": "340", "name": "武威市" },
      { "id": "341", "name": "张掖市" },
      { "id": "342", "name": "平凉市" },
      { "id": "343", "name": "酒泉市" },
      { "id": "344", "name": "庆阳市" },
      { "id": "345", "name": "定西市" },
      { "id": "346", "name": "陇南市" },
      { "id": "347", "name": "临夏回族自治州" },
      { "id": "348", "name": "甘南藏族自治州" }
    ]
  },
  {
    "id": "30",
    "name": "青海",
    "children": [
      { "id": "349", "name": "西宁市" },
      { "id": "350", "name": "海东地区" },
      { "id": "351", "name": "海北藏族自治州" },
      { "id": "352", "name": "黄南藏族自治州" },
      { "id": "353", "name": "海南藏族自治州" },
      { "id": "354", "name": "果洛藏族自治州" },
      { "id": "355", "name": "玉树藏族自治州" },
      { "id": "356", "name": "海西蒙古族藏族自治州" }
    ]
  },
  {
    "id": "31",
    "name": "宁夏",
    "children": [
      { "id": "357", "name": "银川市" },
      { "id": "358", "name": "石嘴山市" },
      { "id": "359", "name": "吴忠市" },
      { "id": "360", "name": "固原市" },
      { "id": "361", "name": "中卫市" }
    ]
  },
  {
    "id": "32",
    "name": "新疆",
    "children": [
      { "id": "362", "name": "乌鲁木齐市" },
      { "id": "363", "name": "克拉玛依市" },
      { "id": "364", "name": "吐鲁番市" },
      { "id": "365", "name": "哈密地区" },
      { "id": "366", "name": "昌吉回族自治州" },
      { "id": "367", "name": "博尔塔拉蒙古自治州" },
      { "id": "368", "name": "巴音郭楞蒙古自治州" },
      { "id": "369", "name": "阿克苏地区" },
      { "id": "370", "name": "克孜勒苏柯尔克孜自治州" },
      { "id": "371", "name": "喀什地区" },
      { "id": "372", "name": "和田地区" },
      { "id": "373", "name": "伊犁哈萨克自治州" },
      { "id": "374", "name": "塔城地区" },
      { "id": "375", "name": "阿勒泰地区" },
      { "id": "376", "name": "省直辖县级行政单位" },
      { "id": "821490", "name": "直辖县级市" }
    ]
  }
];
